###############################################################
#  Generated by:      Cadence Innovus 17.11-s080_1
#  OS:                Linux x86_64(Host ID ce-epo3-cad.ewi.tudelft.nl)
#  Generated on:      Fri Jan 14 16:26:22 2022
#  Design:            module_test
#  Command:           saveDesign ../out/module_test.enc
###############################################################
current_design module_test
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {clk}]  -name clk -period 30.000000 -waveform {0.000000 15.000000}
set_propagated_clock  [get_ports {clk}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -min -pin ZN [get_ports {clk}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -min -pin ZN [get_ports {clk}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -max -pin ZN [get_ports {clk}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -max -pin ZN [get_ports {clk}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -min -pin ZN [get_ports {reset}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -min -pin ZN [get_ports {reset}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -max -pin ZN [get_ports {reset}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -max -pin ZN [get_ports {reset}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -min -pin ZN [get_ports {MISO}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -min -pin ZN [get_ports {MISO}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -max -pin ZN [get_ports {MISO}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -max -pin ZN [get_ports {MISO}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -min -pin ZN [get_ports {button_left}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -min -pin ZN [get_ports {button_left}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -max -pin ZN [get_ports {button_left}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -max -pin ZN [get_ports {button_left}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -min -pin ZN [get_ports {button_right}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -min -pin ZN [get_ports {button_right}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -max -pin ZN [get_ports {button_right}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -max -pin ZN [get_ports {button_right}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -min -pin ZN [get_ports {button_up}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -min -pin ZN [get_ports {button_up}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -max -pin ZN [get_ports {button_up}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -max -pin ZN [get_ports {button_up}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -min -pin ZN [get_ports {button_down}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -min -pin ZN [get_ports {button_down}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -max -pin ZN [get_ports {button_down}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -max -pin ZN [get_ports {button_down}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -min -pin ZN [get_ports {button_mining}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -min -pin ZN [get_ports {button_mining}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -max -pin ZN [get_ports {button_mining}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -max -pin ZN [get_ports {button_mining}]
set_load -pin_load -max  1  [get_ports {MOSI}]
set_load -pin_load -min  1  [get_ports {MOSI}]
set_load -pin_load -max  1  [get_ports {SCLK}]
set_load -pin_load -min  1  [get_ports {SCLK}]
set_load -pin_load -max  1  [get_ports {SS}]
set_load -pin_load -min  1  [get_ports {SS}]
set_load -pin_load -max  1  [get_ports {hsync}]
set_load -pin_load -min  1  [get_ports {hsync}]
set_load -pin_load -max  1  [get_ports {vsync}]
set_load -pin_load -min  1  [get_ports {vsync}]
set_load -pin_load -max  1  [get_ports {red[3]}]
set_load -pin_load -min  1  [get_ports {red[3]}]
set_load -pin_load -max  1  [get_ports {red[2]}]
set_load -pin_load -min  1  [get_ports {red[2]}]
set_load -pin_load -max  1  [get_ports {red[1]}]
set_load -pin_load -min  1  [get_ports {red[1]}]
set_load -pin_load -max  1  [get_ports {red[0]}]
set_load -pin_load -min  1  [get_ports {red[0]}]
set_load -pin_load -max  1  [get_ports {green[3]}]
set_load -pin_load -min  1  [get_ports {green[3]}]
set_load -pin_load -max  1  [get_ports {green[2]}]
set_load -pin_load -min  1  [get_ports {green[2]}]
set_load -pin_load -max  1  [get_ports {green[1]}]
set_load -pin_load -min  1  [get_ports {green[1]}]
set_load -pin_load -max  1  [get_ports {green[0]}]
set_load -pin_load -min  1  [get_ports {green[0]}]
set_load -pin_load -max  1  [get_ports {blue[3]}]
set_load -pin_load -min  1  [get_ports {blue[3]}]
set_load -pin_load -max  1  [get_ports {blue[2]}]
set_load -pin_load -min  1  [get_ports {blue[2]}]
set_load -pin_load -max  1  [get_ports {blue[1]}]
set_load -pin_load -min  1  [get_ports {blue[1]}]
set_load -pin_load -max  1  [get_ports {blue[0]}]
set_load -pin_load -min  1  [get_ports {blue[0]}]
set_wire_load_mode enclosed
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {button_up}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {button_left}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {button_down}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {MISO}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {button_right}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {button_mining}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {reset}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {SS}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {green[3]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {green[1]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {blue[2]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {red[2]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {blue[0]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {red[0]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {SCLK}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {hsync}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {green[2]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {vsync}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {green[0]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {blue[3]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {red[3]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {blue[1]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {red[1]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {MOSI}]
